aaron-bond.better-comments
batisteo.vscode-django
bierner.markdown-mermaid
charliermarsh.ruff
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
github.vscode-github-actions
hbenl.vscode-test-explorer
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-sqlite
njpwerner.autodocstring
redhat.vscode-yaml
ryanluker.vscode-coverage-gutters
shd101wyy.markdown-preview-enhanced
snyk-security.snyk-vulnerability-scanner
tamasfe.even-better-toml
tyriar.sort-lines
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
xabikos.javascriptsnippets
yzhang.markdown-all-in-one
